ThePhilStrongProject/landash/sdkconfig.defaults
# NetDash project defaults. Run `idf.py set-target esp32c6` once; sdkconfig is
# generated from this file and is intentionally not committed.

CONFIG_IDF_TARGET="esp32c6"

# --- Flash / partitions -----------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Console: USB Serial/JTAG so `idf.py monitor` works over the USB-A plug --
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- System -----------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- HTTP server ------------------------------------------------------------
# max_uri_handlers is NOT a Kconfig symbol in IDF 5.5; it is a runtime field of
# httpd_config_t. See NETDASH_HTTPD_MAX_URI_HANDLERS in main/web/http_server.h.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- Networking -------------------------------------------------------------
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_LOCAL_HOSTNAME="landash"
CONFIG_ESP_WIFI_NVS_ENABLED=y

# --- LVGL -------------------------------------------------------------------
# With esp_lvgl_port the LVGL build configuration comes from Kconfig, not from
# an lv_conf.h, so the fonts and the heap size are set here. Owned by WP2.
CONFIG_LV_COLOR_DEPTH_16=y

# Built-in Montserrat sizes used by main/ui/display.c.
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# LVGL's built-in allocator keeps a static pool in DIRAM. The default 64 KB is
# far more than three label-only pages need on a board with no PSRAM. They
# peaked at 14.8 KB of it (lv_mem_monitor, v0.21), so 20 KB leaves room.
CONFIG_LV_MEM_SIZE=20480

# The port scanner runs a small batch of concurrent TCP connects, which the
# default budget of 10 cannot cover once the web server has taken its share.
CONFIG_LWIP_MAX_SOCKETS=16

# --- Firmware updates -------------------------------------------------------
# A freshly installed image boots on probation and the bootloader rolls it back
# if it is not confirmed good (net/ota.c). This changes the BOOTLOADER, which
# an OTA update never replaces: the first image with it has to go on over USB.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# The update check and download are the only TLS this firmware does, and a
# handshake with GitHub took free heap from ~90 KB down to ~35 KB with static
# buffers. Dynamic buffers allocate records to size and free the config and CA
# chain once the handshake is over.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# The TLS read buffer gets a block of its own: see main/net/tls_mem.h.
CONFIG_MBEDTLS_CUSTOM_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
